; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	infrared5 - mode
	image4 - mode
	image3 - mode
	infrared0 - mode
	image2 - mode
	infrared1 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	GroundStation8 - direction
	Star7 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared0)
	(supports instrument1 image4)
	(supports instrument1 infrared5)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 infrared0)
	(supports instrument2 image4)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument3 image4)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 image4)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon13)
	(supports instrument5 infrared1)
	(supports instrument5 infrared5)
	(supports instrument5 image4)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 GroundStation8)
	(supports instrument6 image3)
	(calibration_target instrument6 GroundStation0)
	(calibration_target instrument6 GroundStation5)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(supports instrument7 image4)
	(supports instrument7 image2)
	(calibration_target instrument7 Star7)
	(calibration_target instrument7 GroundStation8)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
)
(:goal (and
	(pointing satellite1 Phenomenon13)
	(pointing satellite2 Star1)
	(have_image Planet9 infrared1)
	(have_image Planet10 infrared0)
	(have_image Planet10 infrared1)
	(have_image Planet11 infrared0)
	(have_image Planet11 image2)
	(have_image Planet12 image3)
	(have_image Planet12 image2)
	(have_image Phenomenon13 infrared5)
	(have_image Phenomenon13 image2)
))

)

; plan
1. (turn_to satellite3 groundstation8 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 groundstation8)
   goals met: 1 of 11
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 1 of 11
3. (calibrate satellite3 instrument7 groundstation8)
   added: (calibrated instrument7)
   goals met: 1 of 11
4. (turn_to satellite3 planet12 groundstation8)
   deleted: (pointing satellite3 groundstation8)
   added: (pointing satellite3 planet12)
   goals met: 1 of 11
5. (take_image satellite3 planet12 instrument7 image2)
   added: (have_image planet12 image2)
   goals met: 2 of 11
6. (turn_to satellite3 planet11 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 planet11)
   goals met: 2 of 11
7. (take_image satellite3 planet11 instrument7 image2)
   added: (have_image planet11 image2)
   goals met: 3 of 11
8. (turn_to satellite3 phenomenon13 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 phenomenon13)
   goals met: 3 of 11
9. (turn_to satellite0 groundstation4 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation4)
   goals met: 3 of 11
10. (take_image satellite3 phenomenon13 instrument7 image2)
   added: (have_image phenomenon13 image2)
   goals met: 4 of 11
11. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 4 of 11
12. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 11
13. (calibrate satellite2 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 4 of 11
14. (calibrate satellite0 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 4 of 11
15. (turn_to satellite0 planet10 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet10)
   goals met: 4 of 11
16. (take_image satellite0 planet10 instrument2 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 5 of 11
17. (turn_to satellite0 planet11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet11)
   goals met: 5 of 11
18. (take_image satellite0 planet11 instrument2 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 6 of 11
19. (turn_to satellite0 planet12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet12)
   goals met: 6 of 11
20. (take_image satellite0 planet12 instrument2 image3)
   added: (have_image planet12 image3)
   goals met: 7 of 11
21. (turn_to satellite2 phenomenon13 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon13)
   goals met: 7 of 11
22. (take_image satellite2 phenomenon13 instrument5 infrared5)
   added: (have_image phenomenon13 infrared5)
   goals met: 8 of 11
23. (turn_to satellite2 planet10 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 planet10)
   goals met: 8 of 11
24. (take_image satellite2 planet10 instrument5 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 9 of 11
25. (turn_to satellite2 planet9 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 planet9)
   goals met: 9 of 11
26. (take_image satellite2 planet9 instrument5 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 10 of 11
27. (turn_to satellite2 star1 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star1)
   goals met: 11 of 11
